[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
*
+
-
/
0
1
2
3
4
5
6
7
8
9
=
##8
##3
##2
##4
##1
##0
##5
##6
##9
##7
10
11
12
13
14
15
16
17
18
19
20
21
26
30
23
24
25
27
28
22
37
29
34
43
31
46
33
40
38
35
44
39
60
51
55
36
56
32
49
59
48
58
47
41
72
52
50
57
53
45
42
70
54
69
71
74
68
63
62
96
73
75
87
61
79
82
80
98
77
66
65
76
67
94
64
85
83
93
100
84
89
95
90
99
78
81
88
86
92
91
97
##00
##60
##40
##20
##80
##50
##88
##04
##28
##52
##30
##68
##25
##56
##75
##44
##64
##72
##76
##48
##70
##32
##96
##10
##92
##90
##84
##16
##36
##12
##24
##08
106
102
108
##86
##74
110
125
115
##46
107
##42
##18
##98
##95
120
132
##14
104
105
130
##22
##62
103
113
##15
124
144
##06
101
128
117
##38
##35
##55
119
##02
116
126
109
127
112
145
##85
138
##05
##78
114
136
##94
153
##82
##66
122
##26
133
135
180
131
152
164
156
##65
111
151
150
148
141
123
129
134
155
159
161
##03
137
##63
118
139
##45
##54
140
672
##81
##01
142
147
154
162
##39
##61
157
##34
##58
##59
##67
149
182
143
165
##49
##09
121
168
172
160
192
462
##33
146
##97
##73
##71
166
188
360
##89
##91
1400
171
1960
##83
##69
163
720
960
##23
##21
##47
##51
##99
1140
170
264
##43
##41
##19
##57
##77
1200
1260
158
175
177
600
1008
##17
##79
173
2376
240
##37
##07
169
189
336
396
576
640
##13
##53
##93
174
2160
252
280
378
495
780
##87
##31
##27
##11
1080
1092
1440
178
183
2046
528
5700
450
420
630
616
792
990
1120
1188
1152
1176
1300
1320
1368
1782
190
1920
300
270
288
2880
3520
552
594
540
1386
1560
1540
184
1800
1848
1980
2016
216
2688
2610
231
2352
2400
276
3780
2940
3900
5544
588
840
1275
1296
1350
1344
1520
1575
1650
1674
1760
186
1995
3060
2760
2970
315
468
480
585
572
624
675
936
900
1040
1044
1170
1450
1462
1680
1764
198
2088
2184
2112
2660
2808
2244
2964
3432
432
3150
4680
3552
3960
510
324
320
4752
546
684
800
660
896
864
1258
1134
##29
1564
167
1656
176
179
1728
185
1890
1886
200
2070
210
2139
2640
3080
230
2346
2772
4368
3120
330
408
400
440
4416
3640
3268
3264
490
484
728
5040
5760
539
4560
704
5400
680
870
6603
648
784
810
882
910
1479
1088
1056
1218
1235
1380
1330
1364
1472
1568
1512
1700
1748
1794
1701
1820
1872
196
1968
1932
204
2040
2100
260
2600
2380
2325
256
2560
2520
2592
2700
2720
2730
2204
376
3760
2928
3420
3404
3430
3456
4320
4312
3168
3198
460
3360
3330
384
3840
3854
350
441
4400
4455
608
6072
368
3600
567
3276
4896
418
414
500
4536
4200
693
682
736
756
612
980
832
1000
952
868
924
912
1326
1513
1050
1100
1248
1216
1224
1360
1428
1496
1485
1600
1740
1750
1710
1716
1798
187
1840
1804
1900
1914
2050
2058
2142
2664
2646
308
2350
2304
2475
2436
2550
2508
2728
2856
2886
222
225
2240
2296
3720
3772
3762
2975
2958
348
3465
312
3185
3300
4032
4012
4002
380
385
3864
3588
4480
392
6048
3290
598
470
4100
4140
4180
5251
504
5088
690
696
714
798
828
988
6600
940
850
846
8930
957
816
8100
888
1026
1209
1020
1160
1104
1196
1122
1290
1242
1394
1404
1456
1424
1504
1628
1672
1632
1612
1624
1785
1767
181
1892
195
1950
1904
1925
1924
1974
1971
208
2028
2068
2079
2132
2190
2146
2106
2178
2652
3040
3072
3010
3036
3038
232
2340
2356
2349
2480
2464
2448
2496
2442
2418
250
2535
273
2788
2800
2850
2842
2210
2208
2295
2205
370
296
2960
2904
2925
2914
342
345
3476
4300
4600
4606
3312
3381
405
3800
3825
3540
3510
4402
390
3920
3956
3948
518
5530
5548
364
3696
3626
568
3240
3280
3234
494
5904
486
580
475
4128
5280
5244
5046
574
5796
532
456
700
744
741
688
6370
627
6240
6230
966
738
750
7584
806
8084
770
7735
650
768
945
949
855
836
930
782
880
1254
1617
1032
1036
1184
1230
1225
1274
1222
1372
1332
1452
1444
1470
1482
1500
1550
1525
1584
1536
1508
1518
1620
1625
1610
1692
1638
1666
1720
1725
1776
1860
1880
1936
1961
1917
2000
2052
2002
2054
219
2128
2176
2170
266
2604
2668
2666
2623
304
238
2300
2310
248
243
2430
2484
2494
2457
2500
2556
2576
2590
272
275
2784
2716
2774
2706
285
286
2870
2220
2214
2262
3770
3724
2900
2924
2915
2967
3400
3440
3496
434
430
4324
4366
3100
3174
3162
465
4620
4650
4648
4698
4697
4000
4080
4088
3870
3818
3500
3528
3564
3570
448
444
4420
4428
6004
513
516
5152
5184
5141
550
5568
3648
3690
3612
3655
561
560
329
4900
4914
592
595
5952
4830
410
4104
4130
4136
520
5292
5015
5049
5742
531
5320
4500
4539
4557
4256
7068
544
5460
5488
6930
7104
7161
637
6300
6375
7332
7392
873
874
825
8265
989
7728
6624
658
6586
765
7650
6720
946
6461
837
1001
8455
891
897
8928
950
9506
902
783
8118
9200
9702
1023
1102
1105
1155
1054
1131
1139
1166
1539
1311
1653
1064
1125
1175
1144
1118
1232
1292
1215
1376
1342
1488
1476
1408
1406
1530
1596
1598
1595
1581
1660
1768
1888
1856
1870
1836
1824
1862
1863
194
1998
1938
1953
2080
2025
2075
2090
2001
2067
2156
2162
2183
265
2632
2684
2698
306
3000
3075
3016
3024
3008
3074
3055
3009
2368
2370
2322
2378
2303
246
2419
258
255
2580
2528
2552
2548
2516
2542
2522
279
2790
2709
2773
2844
2898
2814
2822
2838
2881
2871
228
224
2280
2288
2268
2256
2275
2232
374
3784
3738
3705
3723
297
2968
2976
2912
340
3402
3477
3431
437
4332
4335
4389
310
3104
3196
3108
3115
3135
3182
3145
4675
4686
4602
338
332
3384
3306
3366
3363
3354
3397
4050
4070
4042
4018
3880
3869
351
3536
4488
4452
4425
4472
395
3968
3975
3906
3978
3901
517
5160
5104
5170
5106
5133
5586
5518
3608
3663
564
328
322
3200
3256
3286
3255
3237
498
4928
4930
4998
5940
5978
4850
4828
4875
4845
4851
5810
4750
4788
4770
416
4160
4185
4158
7200
7238
7209
7227
522
525
5200
5208
507
5060
5084
5022
5005
5073
570
5396
5336
5369
4550
4590
4524
4526
4559
425
4260
4275
4212
4214
4278
703
702
7052
7030
5440
5428
5456
5472
5494
6900
711
7140
748
742
7425
6391
621
620
6225
6290
6298
962
732
7347
754
8730
6144
8232
986
7790
666
6688
6525
7626
6480
1005
8428
8448
8415
992
819
861
925
9212
918
972
975
979
1062
1022
1089
1159
1071
1207
1302
1247
1287
1197
1161
1365
1533
1643
1649
1501
1683
4623
1887
1711
1012
1024
1014
1128
1156
1148
1110
1190
1136
1250
1288
1272
1340
1316
1395
1378
1480
1410
1474
1426
1580
1548
1505
1664
1615
1704
1775
1792
1786
1722
1702
1734
1749
1850
1830
1875
1876
1896
1846
1881
1833
197
1940
1975
1944
1972
1976
1908
207
2010
2074
2006
2059
2091
2013
2150
2125
2144
2145
2109
2133
2173
2193
261
2680
2625
2695
2697
2691
2607
3050
3078
3066
3026
3021
3087
235
2320
2375
2318
2394
2397
245
2450
2444
2492
2408
2414
2415
2405
2478
2482
2465
2403
259
2530
2574
2546
2538
2511
2750
2752
2775
2744
2736
2755
2701
2739
2793
2860
2820
2862
2805
2849
220
2250
2225
2272
2278
2294
2233
2231
377
3776
3774
3795
3726
3763
3773
292
294
291
290
2950
2944
2992
2990
344
3480
3450
3444
3408
3486
3403
3445
3417
4350
4352
4356
4392
4386
4374
4399
4307
316
3160
3136
3186
3195
3102
3105
3154
3139
4640
4644
4672
4692
4674
4662
4655
3350
3325
3332
3392
3315
3355
3339
3337
402
4048
4095
4085
4005
4094
4067
4089
4087
3888
3816
3886
3895
3822
357
3504
3525
3534
3577
4450
4410
4459
3952
3944
3996
3990
3922
3965
3977
6000
6020
6080
6068
6090
6016
6003
6059
6083
5100
5130
5168
5112
5159
553
555
5504
5590
5561
5589
365
3650
3672
3698
3666
3634
5600
5680
5688
5628
5644
5632
5605
5626
5643
323
325
3225
3245
3267
3283
496
4940
4980
4950
4956
4964
4992
4984
4902
4947
590
5920
5922
488
483
4800
4880
4836
4814
4802
4819
584
5840
5880
5850
5824
5865
476
4760
4740
4720
4779
415
4125
4148
4116
4182
7252
7221
5220
5250
5225
5264
5214
5278
506
5056
5032
5063
578
5785
5734
5304
5330
5368
5376
5346
5313
451
459
4544
4503
4558
4599
4240
4230
4272
4248
4292
4290
4218
4221
708
7050
7084
7008
5476
6972
6970
6992
6942
710
7100
7128
7110
7138
7440
7488
7452
7469
6804
6864
6853
638
636
6348
6392
6336
6365
6200
6264
6272
6270
6237
968
735
7304
7372
7310
752
759
7546
7566
876
8700
611
6160
6142
6138
7920
7968
7912
8010
984
9800
776
7708
663
664
667
6696
6636
6674
6642
6622
656
760
7656
7636
7695
670
679
6764
6716
944
9408
9405
6468
6497
854
8500
833
8352
8400
8463
890
9500
812
8190
884
8800
8835
860
8640
8624
928
9215
9207
9100
9120
9114
1067
1106
1078
1323
1045
1058
1035
1449
1178
1173
1269
1458
1457
1369
1517
1551
1593
1591
1377
1183
1491
1729
1025
1095
1180
1150
1164
1116
1185
1240
1298
1328
1325
1375
1392
1425
1475
1464
1495
1422
1435
1455
1494
1463
1590
1566
1640
1652
1606
1694
1665
1681
1691
1679
1736
1738
1755
1825
1806
1805
1826
1849
1869
193
1992
1984
1922
1955
1978
1947
1943
203
209
2044
2064
2024
2015
2035
2009
2047
213
215
217
2130
2175
2116
2136
2124
2108
2115
2135
2166
2107
2650
2628
2624
2686
2618
2622
2635
2655
2639
2619
2627
3025
3002
3003
3034
3071
3007
234
236
237
2328
2336
2324
2385
2387
2331
244
249
2460
2440
2470
2432
2438
2409
2499
2479
2544
2584
2585
2565
2581
2501
2597
2573
2541
2795
2703
2754
2759
2769
282
284
287
2840
2888
2832
2890
2816
2806
2867
2883
2821
221
2200
2236
2212
2242
2254
2201
2241
2279
2211
372
3700
3752
3710
3792
3783
3731
295
2952
2948
2982
2961
2989
2923
2937
2911
343
341
3472
3492
3484
3416
3422
3483
438
435
4370
4316
4346
4355
4345
4371
4347
319
3128
3132
3192
3159
3157
3127
3111
4628
4608
4615
4661
4617
4611
335
3375
3344
3364
3362
3358
3311
403
4060
4004
4028
4056
4092
4015
4026
4081
4059
4071
3850
3828
3872
3876
3848
3808
3861
3871
3843
3827
352
3572
3596
3584
3542
3538
3555
3526
3569
3599
3519
442
4464
4484
4446
4422
4482
4466
4473
4489
399
3950
3910
3984
3916
3936
3942
3995
3905
3933
3999
3953
603
609
6075
6014
512
5148
5115
5135
5194
5183
551
559
5520
5580
5510
5538
369
3660
3652
3692
3621
3619
5696
5642
5658
5621
3250
3204
3248
3216
3212
3298
3243
3219
493
492
497
4920
4988
4968
4970
4982
4959
4941
4929
5928
5964
5984
5916
5986
5915
5963
5913
